{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v3.12.0", "signature": {"inputs": {"lstm_input": {"name": "lstm_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}}, "outputs": {"dense_3": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "240"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "60"}, {"size": "240"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "240"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "60"}, {"size": "40"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}, {"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/dense_3/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "lstm_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_35", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/Read/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_36", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/Read_1/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_37", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/Read_2/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_29", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/time"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_27", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential/lstm/Shape", "op": "Shape", "input": ["lstm_input"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose", "op": "Transpose", "input": ["lstm_input", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_46", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_35", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_82"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_47", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_36", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_83"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_48", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_37", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_84"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_40", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_29", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_76"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_38", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_27", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_74"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm/Shape", "StatefulPartitionedCall/sequential/lstm/strided_slice/stack", "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_1", "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/lstm/strided_slice", "StatefulPartitionedCall/sequential/lstm/zeros_1/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/lstm/strided_slice", "StatefulPartitionedCall/sequential/lstm/zeros/packed/1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_34", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/Shape", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/lstm/zeros_1/packed", "StatefulPartitionedCall/sequential/lstm/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/lstm/zeros/packed", "StatefulPartitionedCall/sequential/lstm/zeros/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_45", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_34", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_81"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_33", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_32", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/zeros_1"], "attr": {"T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_31", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/zeros"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_30", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_VARIANT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_44", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_33", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_80"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_43", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_32", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_79"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_42", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_31", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_78"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_41", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_30", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_77"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/cond/_25/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_40", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_44", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_38"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_49", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/cond/_25/while/Less"]}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_16_switch/_55", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_43", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_49"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_57", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_45", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_49"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_17_switch/_58", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_46", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_49"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_15_switch/_54", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_42", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_49"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_18_switch/_59", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_47", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_49"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_19_switch/_60", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_48", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_49"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/time_switch/_52", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_40", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_49"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter_switch/_50", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_38", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_49"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1_switch/_53", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_41", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_49"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_switch/_56", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_44", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_49"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_61", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter_switch/_50:1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/exit/_65", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1_switch/_53"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/split/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_81", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_57:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_82", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_17_switch/_58:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_83", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_18_switch/_59:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_15_switch/_54:1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_18_switch/_59:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_61"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_84", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_19_switch/_60:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/input/_101", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/time_switch/_52:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/add_2/y", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/add_3/y", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_80", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_switch/_56:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/exit/_65", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_57:1", "Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/input/_101", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/add_2", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/input/_101", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/add_2/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter_switch/_50:1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/add_3/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack_1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_17_switch/_58:1"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_76", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/add_2", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_74", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/add_3", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2", "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/MatMul", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/dense/Relu", "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/add", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_19_switch/_60:1"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential/dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/dense_1/BiasAdd", "StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/split", "op": "Split", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/split/split_dim", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/BiasAdd"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_3/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/dense_2/BiasAdd", "StatefulPartitionedCall/sequential/dense_3/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/dense_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_3/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential/dense_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/Sigmoid_1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_16_switch/_55:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/Sigmoid", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/dense_3/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/mul", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/Tanh_1", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_79", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/add_1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/Sigmoid_2", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_78", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/mul_2", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1_switch/_53:1", "Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/input/_101", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/mul_2"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_77", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/TensorArrayV2Write/TensorListSetItem", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"T": {"type": "DT_VARIANT"}}}], "library": {}, "versions": {"producer": 898}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/Read/ReadVariableOp", "shape": [1, 240], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm/Read_1/ReadVariableOp", "shape": [60, 240], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm/Read_2/ReadVariableOp", "shape": [240], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/time", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "shape": [60, 40], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp", "shape": [40], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "shape": [40, 20], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp", "shape": [20], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp", "shape": [20, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp", "shape": [10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_3/MatMul/ReadVariableOp", "shape": [10, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_3/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/TensorArrayV2Read/TensorListGetItem/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/add_2/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_26/while/add_3/y", "shape": [], "dtype": "int32"}]}]}