{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v3.12.0", "signature": {"inputs": {"lstm_1_input": {"name": "lstm_1_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}}, "outputs": {"dense_8": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/Read/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "240"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "60"}, {"size": "240"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/Read_2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "240"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_4/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "60"}, {"size": "60"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "60"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_5/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "60"}, {"size": "40"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_6/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}, {"size": "20"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_6/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_7/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_7/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_8/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_8/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "lstm_1_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_37", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/Read/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_38", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/Read_1/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_39", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/Read_2/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_31", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/time"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_29", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_counter"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/Shape", "op": "Shape", "input": ["lstm_1_input"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/transpose", "op": "Transpose", "input": ["lstm_1_input", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_48", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_37", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_84"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_49", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_38", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_85"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_50", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_39", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_86"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_42", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_31", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_78"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_40", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_29", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_76"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/Shape", "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack", "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack_1", "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/transpose", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/strided_slice", "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/strided_slice", "StatefulPartitionedCall/sequential_1/lstm_1/zeros/packed/1"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_36", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/Shape", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/packed", "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/zeros/packed", "StatefulPartitionedCall/sequential_1/lstm_1/zeros/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_47", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_36", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_83"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_35", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice"], "attr": {"T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_34", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/zeros_1"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_33", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/zeros"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_32", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayV2_1"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_46", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_35", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_82"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_45", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_34", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_81"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_44", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_33", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_80"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_43", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_32", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_79"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/cond/_27/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_42", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_46", "^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_40"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/LoopCond/_51", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/cond/_27/while/Less"]}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/input/_18_switch/_57", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_45", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_59", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_47", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/input/_19_switch/_60", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_48", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/input/_17_switch/_56", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_44", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/input/_20_switch/_61", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_49", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/input/_21_switch/_62", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_50", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/time_switch/_54", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_42", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_counter_switch/_52", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_40", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayV2_1_switch/_55", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_43", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice_switch/_58", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_46", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/LoopCond/_51"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_63", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_counter_switch/_52:1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/exit/_67", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayV2_1_switch/_55"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/split/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_63"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_83", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_59:1", "^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_63"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_84", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/input/_19_switch/_60:1", "^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_85", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/input/_20_switch/_61:1", "^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/input/_17_switch/_56:1", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/input/_20_switch/_61:1", "^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_63"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_86", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/input/_21_switch/_62:1", "^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/input/_103", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/time_switch/_54:1", "^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/add_2/y", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_63"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/add_3/y", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_63"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_82", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice_switch/_58:1", "^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/exit/_67", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "-1"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_59:1", "Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/input/_103", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/add_2", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/input/_103", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/add_2/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_counter_switch/_52:1", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/add_3/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice_2/stack", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice_2/stack_1", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/input/_19_switch/_60:1"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_78", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/add_2", "^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_76", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/add_3", "^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_4/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice_2", "StatefulPartitionedCall/sequential_1/dense_4/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/MatMul", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_5/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_4/Relu", "StatefulPartitionedCall/sequential_1/dense_5/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/add", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/input/_21_switch/_62:1"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_6/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_5/Relu", "StatefulPartitionedCall/sequential_1/dense_6/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_6/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/split", "op": "Split", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/split/split_dim", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_7/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_6/Relu", "StatefulPartitionedCall/sequential_1/dense_7/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_7/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_8/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_7/Relu", "StatefulPartitionedCall/sequential_1/dense_8/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_8/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/Sigmoid_1", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/input/_18_switch/_57:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/Sigmoid", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_8/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_1/dense_8/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/mul", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/dense_8/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/Tanh_1", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_81", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/add_1", "^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/Sigmoid_2", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_80", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/mul_2", "^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayV2_1_switch/_55:1", "Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/input/_103", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/mul_2"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_79", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/TensorArrayV2Write/TensorListSetItem", "^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_63"], "attr": {"T": {"type": "DT_VARIANT"}}}], "library": {}, "versions": {"producer": 898}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayV2_1/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/Read/ReadVariableOp", "shape": [1, 240], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/Read_1/ReadVariableOp", "shape": [60, 240], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/Read_2/ReadVariableOp", "shape": [240], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/time", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_counter", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice_2/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice_2/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice_2/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_4/MatMul/ReadVariableOp", "shape": [60, 60], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_4/BiasAdd/ReadVariableOp", "shape": [60], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_5/MatMul/ReadVariableOp", "shape": [60, 40], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_5/BiasAdd/ReadVariableOp", "shape": [40], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_6/MatMul/ReadVariableOp", "shape": [40, 20], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_6/BiasAdd/ReadVariableOp", "shape": [20], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_7/MatMul/ReadVariableOp", "shape": [20, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_7/BiasAdd/ReadVariableOp", "shape": [10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_8/MatMul/ReadVariableOp", "shape": [10, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_8/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/TensorArrayV2Read/TensorListGetItem/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/add_2/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_28/while/add_3/y", "shape": [], "dtype": "int32"}]}]}